04_OpenFoam/_Tut_02/OpenFOAM-14/compressibleVoF/climbingRod/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

units [mm];

// H         77;
R         6.35;
Rc        152.25;
hTotal    110;

rCells     80;
hCells     80;

rGrading
(
    (0.1 1    1)
    (0.9 2.25 10)
);

hGrading
(
    (0.65 2   0.1)
    (0.2  2.4 1)
    (0.15 1.2 2)
);

vertices
(
    ($R   0  -1)
    ($Rc  0  -1)
    ($R  $hTotal  -1)
    ($Rc $hTotal  -1)

    ($R   0   0)
    ($Rc  0   0)
    ($R  $hTotal   0)
    ($Rc $hTotal   0)

);

blocks
(
    hex (0 1 3 2 4 5 7 6)
    ($rCells $hCells 1)
    simpleGrading ($rGrading $hGrading 1)
);

boundary
(
    rod
    {
        type wall;
        faces
        (
            (0 2 6 4)
        );
    }
    vessel
    {
        type wall;
        faces
        (
            (1 3 7 5)
            (0 1 5 4)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }
    back
    {
        type symmetry;
        faces
        (
            (0 2 3 1)
        );
    }
    front
    {
        type symmetry;
        faces
        (
            (4 5 7 6)
        );
    }
);


// ************************************************************************* //
